Nomor 5 - Adrian Dwi Adinata

a) Buatlah sebuah Series menggunakan angka random integer dari 1 
hingga 5 sebanyak 100!

In [2]:
# Import putsaka numpy dan pandas terlebih dahulu

import numpy as np
import pandas as pd

In [2]:
# Series yang terdiri dari angka random integer 1 sampai 5 sebanyak 100

index = np.arange(0,100)
data = np.random.randint(1,5,100)

pd.Series(data, index)

0     4
1     3
2     1
3     2
4     3
     ..
95    2
96    1
97    4
98    2
99    2
Length: 100, dtype: int32

In [3]:
# Cara lain

# series yang terdiri dari angka random integer 1 sampai 5 sebanyak 100
np.random.seed(101)
num_series = pd.Series(np.random.randint(1, 5, 100))
num_series

0     4
1     4
2     2
3     3
4     4
     ..
95    4
96    1
97    3
98    3
99    3
Length: 100, dtype: int32

b) Hitunglah banyaknya frekuensi tiap angka!

In [12]:
# Menghitung banyaknya jumlah setiap angka

pd.Series(data).value_counts()

4    26
3    26
2    26
1    22
dtype: int64

In [4]:
# Cara lain

# menghitung banyaknya jumlah tiap angka
num_series.value_counts()

4    36
1    30
3    18
2    16
dtype: int64

c) Cari tahu 2 nilai dengan frekuensi tertinggi!

In [13]:
# Mencari tahu 2 angka terbanyak

tabel = {'value': pd.Series(data),
        'Frequency': pd.Series(data).value_counts()}

In [14]:
df = pd.DataFrame(tabel)

In [15]:
df

    value  Frequency
0       4        NaN
1       3       22.0
2       1       26.0
3       2       26.0
4       3       26.0
..    ...        ...
95      2        NaN
96      1        NaN
97      4        NaN
98      2        NaN
99      2        NaN

[100 rows x 2 columns]

In [20]:
by_data = df.groupby("value")

In [18]:
by_data.max(2)

       Frequency
value
1           26.0
2           26.0
3           26.0
4            NaN

In [5]:
# Cara lain

# mencari tahu 2 angka yang paling sering muncul
df_vc = pd.DataFrame(num_series.value_counts(), columns = ['Frequency']).reset_index()
df_vc = df_vc.rename(columns = {'index': 'value'})
df_vc.sort_values(by='Frequency', ascending=False).head(2)

   value  Frequency
0      4         36
1      1         30